Catalogs/МТ_ПредопределенныеЗначения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>МТ_ПредопределенныеЗначения</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>512</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Список</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>512</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/МТ_ПредопределенныеЗначения/Ext/ManagerModule.bsl
Функция ПолучитьЗначениеПоСвойству(Ссылка, Свойство = Неопределено) Экспорт
	
	ВозвращаемоеЗначение = Неопределено;
	
	Если Не Свойство = Неопределено Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	МТ_ПредопределенныеЗначенияСписок.Свойство,
		|	МТ_ПредопределенныеЗначенияСписок.Значение
		|ИЗ
		|	Справочник.МТ_ПредопределенныеЗначения.Список КАК МТ_ПредопределенныеЗначенияСписок
		|ГДЕ
		|	МТ_ПредопределенныеЗначенияСписок.Ссылка = &Ссылка
		|	И МТ_ПредопределенныеЗначенияСписок.Свойство = &Свойство";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("Свойство", Свойство);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ВозвращаемоеЗначение = Выборка.Значение;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции 

Функция ПолучитьМассивЗначенийПоСвойству(Ссылка, Свойство = Неопределено) Экспорт
	
	МассивЗначений = Неопределено;
	
	Если Не Свойство = Неопределено Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	МТ_ПредопределенныеЗначенияСписок.Свойство,
		|	МТ_ПредопределенныеЗначенияСписок.Значение
		|ИЗ
		|	Справочник.МТ_ПредопределенныеЗначения.Список КАК МТ_ПредопределенныеЗначенияСписок
		|ГДЕ
		|	МТ_ПредопределенныеЗначенияСписок.Ссылка = &Ссылка
		|	И МТ_ПредопределенныеЗначенияСписок.Свойство = &Свойство";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("Свойство", Свойство);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			МассивЗначений = Выборка.Значение;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат МассивЗначений;
	
КонецФункции

Функция ПолучитьТаблицуВсехСвойствЗначений(Ссылка) Экспорт
//+Гавриленков В. 13.02.2026 #UT10-5690	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МТ_ПредопределенныеЗначенияСписок.Свойство,
	|	МТ_ПредопределенныеЗначенияСписок.Значение
	|ИЗ
	|	Справочник.МТ_ПредопределенныеЗначения.Список КАК МТ_ПредопределенныеЗначенияСписок
	|ГДЕ
	|	МТ_ПредопределенныеЗначенияСписок.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Таблица = Запрос.Выполнить().Выгрузить();
	
	Если Таблица.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Таблица;
	
//-Гавриленков В. 13.02.2026 #UT10-5690	
КонецФункции

Функция ВключитьБлокировкуПерепроведенияДокументовТОХ(ТипДокСсылка) Экспорт
	
	//+Шульман А. 29.04.2025 #UT10-5197
	Для каждого тзСтрока Из Справочники.МТ_ПредопределенныеЗначения.ВключитьБлокировкуПерепроведенияДокументовТОХ.Список Цикл
		
		Если ТипЗнч(тзСтрока.Свойство) = ТипДокСсылка Тогда
			Возврат тзСтрока.Значение;
		КонецЕсли;
	
	КонецЦикла;
	
	Возврат Ложь; 
	//-Шульман А. 29.04.2025 #UT10-5197

КонецФункции // ()
